# Создадим игровое поле с координатами и пустыми списками для заполнения в них наших крестиков и ноликов
pole = [[' ', 1, 2, 3],
        [1, ' ', ' ', ' '],
        [2, ' ', ' ', ' '],
        [3, ' ', ' ', ' ']]

print("Наше игровое поле будет выглядить так:")  # Обьясним правила, зададим порядок хода и изобразим игрокам наше поле.
for i in pole:
    for j in i:
        print(j, end='|')
    print()
print("____________________")
print("""Ход начинает игрок № 1 играющий за крестики "х" """)
print(
    """Игрок должен выбрать ход указав координаты клеточки, где первая цифра это стобец, вторая цифра строчка и цифры вводятся через пробел""")
print('Пример хода:')
print("1 2")
print("____________________")
count = 0  # Счетчик ходов, всего в поле свободно 9 клеток (3х3), значит максимальное кол-во ходов у нас 9
pobeda = 0  # Зададим переменную "победу" , чтобы у нас не было конфликта , когда победа происходит на последнем ходе (ход 9)
while count <= 9:  # проверяем остались ли у нас ходы
    if count == 9 and pobeda != 1:  # проверяем не победил ли кто-то на 9ом ходу
        print("Stop igra - Ничья!")
        count += 1
        break
    if count % 2 == 0 and count != 9:  # Если это четных ход (2, 4, 6, и т.д. начиная с 0) то ходит игрок № 1 и ставит крестики
        n = list(map(int, input(
            "Вввидите координаты через пробел:").split()))  # вводим координаты в виде списка и берем координатами по индексу нашего списка [0] [1]
        if n[0] > 3 or n[0] < 1 or n[1] > 3 or n[1] < 1:  # проверяем вводят ли правильные координаты
            print("Вне координат!")
            continue
        if pole[n[1]][n[0]] == "0" or pole[n[1]][n[0]] == "x":  # проверяем не вводят ли занятые координаты
            print("Там занято! Выбери другую ячейку!")
            continue
        pole[n[1]][n[0]] = "x"  # записываем ход в таблицу и печатаем ее
        count += 1
        for i in pole:
            for j in i:
                print(j, end='|')
            print()
        if (pole[1][1] == "x" and pole[2][2] == "x" and pole[3][3] == "x") or (  # проверяем выиграшные комбинации
                pole[1][1] == "x" and pole[2][1] == "x" and pole[3][1] == "x") or (
                pole[1][2] == "x" and pole[2][2] == "x" and pole[3][2] == "x") or (
                pole[1][3] == "x" and pole[2][3] == "x" and pole[3][3] == "x") or (
                pole[1][1] == "x" and pole[1][2] == "x" and pole[1][3] == "x") or (
                pole[2][1] == "x" and pole[2][2] == "x" and pole[2][3] == "x") or (
                pole[3][1] == "x" and pole[3][2] == "x" and pole[3][3] == "x") or (
                pole[3][1] == "x" and pole[2][2] == "x" and pole[1][3] == "x"):
            print("Победил игрок № 2")
            count = 9  # если есть выигрышная комбинация - закрываем принудительно счетчик ходов и засчитываем победу в переменную
            pobeda += 1
    if count % 2 != 0 and count != 9:  # оже все самое но с нечетным ходом, для того, кто будет играть ноликами.
        n = list(map(int, input("Вввидите координаты через пробел:").split()))
        if n[0] > 3 or n[0] < 1 or n[1] > 3 or n[1] < 1:
            print("Вне координат!")
            continue
        if pole[n[1]][n[0]] == "0" or pole[n[1]][n[0]] == "x":
            print("Там занято! Выбери другую ячейку!")
            continue
        pole[n[1]][n[0]] = "0"
        count += 1
        for i in pole:
            for j in i:
                print(j, end='|')
            print()
        if (pole[1][1] == "0" and pole[2][2] == "0" and pole[3][3] == "0") or (
                pole[1][1] == "0" and pole[2][1] == "0" and pole[3][1] == "0") or (
                pole[1][2] == "0" and pole[2][2] == "0" and pole[3][2] == "0") or (
                pole[1][3] == "0" and pole[2][3] == "0" and pole[3][3] == "0") or (
                pole[1][1] == "0" and pole[2][1] == "0" and pole[3][1] == "0") or (
                pole[2][1] == "0" and pole[2][2] == "0" and pole[2][3] == "0") or (
                pole[3][1] == "0" and pole[3][2] == "0" and pole[3][3] == "0") or (
                pole[3][1] == "0" and pole[2][2] == "0" and pole[1][3] == "0"):
            print("Победил игрок № 2")
            count = 9
            pobeda += 1
